{"content":"<h1 id=\"hellofuturesoftwareengineers\">Hello Future Software Engineers,</h1>\n<p>I’m Arthur Bernier Jr., also known in the tech community as Big Poppa Code. With a deep background as a CTO, Technical Advisor, and Senior Software Engineer, I have transformed complex tech languages into simple, actionable steps for learners worldwide. I have dedicated my career to empowering individuals by demystifying technology and providing innovative solutions. Now, I introduce to you the Code Come Up, a Software Engineering Career Accelerator designed to launch your career in tech with no upfront costs.</p>\n<p><strong>Why Choose Code Come Up?</strong></p>\n<p>Code Come Up is uniquely structured to ensure accessibility and success. You start for free and only pay when you need personalized support. Our course delivery via asynchronous videos and detailed articles allows you to learn at your pace without sacrificing the depth of learning or personal attention.</p>\n<p><em>Also if you are a startup founder with a Delaware registered C-Corp & Carta(or similar) ask us about our equity based compensation for training program. To apply you will need a deck and monetization strategy.</em></p>\n<h2 id=\"keyfeatures\">Key Features:</h2>\n<ul>\n<li><strong>No Upfront Cost:</strong> Start learning without any initial financial burden.</li>\n<li><strong>Personalized Code Reviews by Big Poppa Code:</strong> Each code review is meticulously done by me, providing detailed feedback on what you are doing right and where you need improvement.</li>\n<li><strong>Asynchronous Learning:</strong> Engage with content at your convenience, enhanced by step-by-step instructions and comprehensive documentation.</li>\n<li><strong>AI-Assisted Email Support:</strong> Included in the support plan, this feature allows you to ask questions and get clarifications with a guaranteed 3-5 business day response time.</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li><strong>Flexibility:</strong> Juggle learning with personal commitments by setting your own study schedule.</li>\n<li><strong>Focused Support:</strong> Opt for additional help only when necessary, keeping the learning process cost-effective and tailored.</li>\n<li><strong>Comprehensive Curriculum:</strong> From foundational programming to advanced system design and career development, master skills that are crucial for today’s tech industry.</li>\n</ul>\n<p><strong>Syllabus Overview:</strong></p>\n<p><strong>Module 1: HTML, CSS, Wireframing & PSD to HTML</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Learn the basics of front-end development including HTML and CSS. Gain skills in wireframing and converting PSD designs to HTML.</li>\n<li><strong>Final Project:</strong> Clone a website to demonstrate your understanding of layout and basic front-end coding.</li>\n</ul>\n<p><strong>Module 2: Basic JavaScript, OOP & DOM Manipulation, Git, Github & Version Control</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Master JavaScript fundamentals, grasp object-oriented programming, and manage code with Git and GitHub.</li>\n<li><strong>Final Project:</strong> Develop a browser-based game to solidify your understanding of JavaScript and interactive web elements.</li>\n</ul>\n<p><strong>Module 3: Async JavaScript & Frontend Frameworks like React</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Dive into asynchronous JavaScript and the powerful React framework to create dynamic single-page applications.</li>\n<li><strong>Final Project:</strong> Build an API-powered single-page application that interfaces with real-world data.</li>\n</ul>\n<p><strong>Module 4: Advanced JavaScript, Algorithms & Data Structures, Lambda, Unit Testing, Documentation</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Enhance your JavaScript expertise with advanced algorithms, data structures, lambda expressions, unit testing, and documentation.</li>\n<li><strong>Final Project:</strong> Construct a data structure library to demonstrate advanced JavaScript concepts and best practices.</li>\n</ul>\n<p><strong>Module 5: Node, Express, MongoDB, Digital Ocean, CRUD, REST, MVC & API Building</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Learn back-end development using Node.js and Express, manage databases with MongoDB, and deploy applications using Digital Ocean.</li>\n<li><strong>Final Project:</strong> Build and document a REST API that performs CRUD operations.</li>\n</ul>\n<p><strong>Module 6: Full Stack Applications from Development to Deployment with Authentication</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Become proficient in full stack development, integrating front-end and back-end technologies with user authentication.</li>\n<li><strong>Final Project:</strong> Develop a fully functional social network with user authentication and real-time data handling.</li>\n</ul>\n<p><strong>Module 7: System Design Fundamentals</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Understand the fundamentals of system design, focusing on scalability, efficiency, and reliability.</li>\n<li><strong>Final Project:</strong> Diagram and build core features of a system based on a given specification.</li>\n</ul>\n<p><strong>Module 8: Learning New Programming Languages Quickly & Adapting to New Technologies</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Equip yourself with strategies to learn new programming languages and adapt to technological changes rapidly.</li>\n<li><strong>Final Project:</strong> Implement a to-do list application using an alternative tech stack to demonstrate adaptability.</li>\n</ul>\n<p><strong>Module 9: Generative AI, CI/CD, Automation Tools</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Explore the cutting-edge fields of generative AI and automation, and implement continuous integration and continuous delivery (CI/CD) processes.</li>\n<li><strong>Final Project:</strong> Create an automated content generator for social media platforms like Instagram.</li>\n</ul>\n<p><strong>Module 10: Career Growth & Development</strong></p>\n<ul>\n<li><strong>Skills Developed:</strong> Prepare for the tech job market with insights into finding a job, freelancing, starting a business, and contracting.</li>\n<li><strong>Final Project:</strong> Craft a professional portfolio including a resume, LinkedIn profile, personal website, and contributions to open source projects.</li>\n</ul>\n<p><strong>Graduation Capstone:</strong></p>\n<ul>\n<li><strong>Project:</strong> Develop a micro-SaaS application using OpenAI or a similar service, integrated with payment processing via Vonza or Stripe.</li>\n<li><strong>Graduation Requirements:</strong> Successfully pass a portfolio review, coding challenges, live coding sessions, system design evaluations, and a behavioral interview.</li>\n</ul>\n<p>This comprehensive syllabus is designed to build from fundamental concepts to advanced applications, preparing you thoroughly for a successful career in software engineering.</p>\n<p><strong>Pricing Menu:</strong></p>\n<ul>\n<li><strong>Email Support & AI Code Assistant:</strong> $67 per month. This plan includes the ability to ask questions via email about course content, with responses provided within 3-5 business days.</li>\n<li><strong>Deep Code Review(by a qualified professional) A La Carte:</strong><ul>\n<li>Homework/Lab Assignments: $50 each</li>\n<li>Final Project: $200 each</li></ul></li>\n<li><strong>Graduation Evaluation with Feedback:</strong><ul>\n<li>First Time: $649 (includes one free retake)</li>\n<li>Third Attempt: $250 (if needed after a free retake)</li>\n<li>Any Additional Attempts: $499 each</li></ul></li>\n<li><strong>1 on 1 Coaching post graduation:</strong><ul>\n<li>Customized based on goals and commitment</li></ul></li>\n</ul>\n<p><strong>FAQs:</strong></p>\n<ol>\n<li><strong>Can someone complete the entire program without paying anything?</strong><ul>\n<li>Absolutely! The course material is entirely free and openly accessible, so anyone can benefit from the training regardless of their background. While all learning content is free, those who wish to receive personalized feedback or graduate with a certification can opt for paid services. If you choose the free route, consider leaving us a tip to help us continue to deliver valuable content to the marketplace.</li></ul></li>\n<li><strong>When do I need to pay for the graduation evaluation?</strong><ul>\n<li>You do not pay for graduation until you deem yourself ready to graduate. This allows you to control when you feel prepared to take this final step. If you prefer, you can pre-commit to graduating by paying upfront for a significant discount of $250 off the standard graduation evaluation fee for a total of $399.</li></ul></li>\n<li><strong>What are the costs after the course starts?</strong><ul>\n<li>You only pay when you opt for personal support or evaluations. Prices for these services are clearly listed in the syllabus.</li></ul></li>\n<li><strong>How long does the course take to complete?</strong><ul>\n<li>The pace is set by you. Most students can complete the course in 4-12 months, depending on their dedication and prior experience. Some can even complete it immediately if they are a bootcamp graduate or early career developer.</li></ul></li>\n<li><strong>What kind of job support do you offer post-graduation?</strong><ul>\n<li>We provide mentorship, resume reviews, and mock interviews. Our goal is to ensure you not only learn but also secure a position in the tech industry, or start the business you desire. All graduates will get featured on our social media and SEO optimized website. We also will partner with recruiter contacts and strategic partners to help you get where you want to go.</li></ul></li>\n<li><strong>What is the full cost for someone who completes the program in 6 months with email support and does not require a retake on the graduation evaluation?</strong><ul>\n<li><strong>Example Calculation:</strong> If a student subscribes to the Email Support &amp; AI Code Assistant for 6 months, the cost would be 6 x $67 = $402. If they pass their Graduation Evaluation on the first or second attempt, the fee is $649. This brings the total cost to $1,051. This does not include any optional code reviews or 1-on-1 coaching sessions, which can be added based on the student's needs, but this is what an average learner might pay in total.</li></ul></li>\n</ol>\n<p><strong>Conclusion:</strong></p>\n<p>At Code Come Up, your success is our priority. Begin your journey in tech with expert guidance and a supportive community. I, Big Poppa Code, am committed to your growth and ready to help you</p>","data":{"title":"Big Poppa Code’s Code Come Up Career Accelerator Program for Motivated Beginners","subTitle":"A No Up Front Cost Async Optionally Supported Career Accelerator Program for Job or Business Readiness","excerpt":"accelerator program","featureImage":"/img/image1.jpeg","date":"10/21/21"},"isEmpty":false,"excerpt":"","path":"/home/bigpoppacode/code/bigpoppacode.io/api_static/accelerator.md","_id":"accelerator"}