{"content":"<p><center>\n<a href=\"https://buy.stripe.com/aEU6r76te5586UU6or\"><button class=\"btn btn-lg btn-warning\">Get Started Today By Clicking Here</button></a>\n</center></p>\n<h3 id=\"1programoverview\">1. Program Overview</h3>\n<ul>\n<li><strong>Objective:</strong> To elevate the expertise and career prospects of Coding Bootcamp graduates, Self-Taught Developers, CS Graduates, and Early Career Software Engineers.</li>\n<li><strong>Duration:</strong> 6 months</li>\n<li><strong>Format:</strong> Personalized one-on-one coaching sessions held every Saturday, accompanied by a customized curriculum and continuous support.</li>\n</ul>\n<h3 id=\"2coachingstructure\">2. Coaching Structure</h3>\n<ul>\n<li><strong>Total Sessions:</strong> 28 one-on-one sessions conducted on Saturdays over 6 months, focused on personalized coaching and skill enhancement.</li>\n<li><strong>Customized Curriculum:</strong> A curriculum tailored to each participant’s current skills and career goals, designed to bridge gaps and advance knowledge.</li>\n</ul>\n<h3 id=\"3interviewpreparation\">3. Interview Preparation</h3>\n<ul>\n<li><strong>Portfolio Reviews:</strong> Critical evaluations of personal project portfolios to enhance presentation and technical narratives.</li>\n<li><strong>Mock Interviews:</strong> Simulated technical and behavioral interviews with detailed feedback to prepare for real-world scenarios.</li>\n</ul>\n<h3 id=\"4lifelongmentorship\">4. Lifelong Mentorship</h3>\n<ul>\n<li><strong>Continuous Access:</strong> All past, present, and future mentees have lifelong access to the coach via text for reasonable ongoing support and guidance (Current Mentees always get precedence)</li>\n</ul>\n<h3 id=\"5pricingandpackages\">5. Pricing and Packages</h3>\n<ul>\n<li><strong>All-Inclusive Package:</strong> $7,000 for 6 months, including 28 individual coaching sessions and a customized curriculum.</li>\n<li><strong>Curriculum-Only:</strong> $1,500 for a personalized learning plan without coaching sessions.</li>\n<li><strong>A la carte Individual Coaching Sessions:</strong> $397 per session.</li>\n<li><strong>Portfolio Reviews and Mock Interviews:</strong><ul>\n<li>Single Session: $499</li>\n<li>Two Sessions Package: $899</li></ul></li>\n</ul>\n<h3 id=\"6faq\">6. FAQ</h3>\n<ul>\n<li><p><strong>Q1: What does the all-inclusive package include?</strong>\nA1: It includes 28 personalized coaching sessions held on Saturdays, a customized curriculum, and lifelong text access to the coach.</p></li>\n<li><p><strong>Q2: Can I opt for interview preparation only?</strong>\nA2: Yes, we offer packages for portfolio reviews and mock interviews, available as single or multiple sessions.</p></li>\n<li><p><strong>Q3: What if I can only meet on days other than Saturday?</strong>\nA3: Currently, all coaching sessions are scheduled on Saturdays. Please contact us directly if you require a different arrangement.</p></li>\n<li><p><strong>Q4: Is there support available after completing the program?</strong>\nA4: Yes, all mentees enjoy lifelong access to the coach via text, ensuring continuous support and guidance within reason.</p></li>\n<li><p><strong>Q5: What is the refund policy?</strong>\nA5: We offer a pro-rated refund if you decide to cancel within the first month, ensuring satisfaction and flexibility.</p></li>\n<li><p><strong>Q6: Who is the coach?</strong>\nA6: The program is led by a seasoned technologist and educator, experienced in software development, mentorship, and career coaching. Arthur Bernier Jr aka Big Poppa Code</p></li>\n</ul>\n<h2 id=\"thisstructuredprogramisdesignedtobecomprehensiveandpersonalizedaimedatsignificantlyimprovingtechnicalskillsjobperformanceandinterviewreadinesswithallcoachingsessionsconvenientlyscheduledonsaturdaystomeettheneedsofbusyprofessionals\">This structured program is designed to be comprehensive and personalized, aimed at significantly improving technical skills, job performance, and interview readiness, with all coaching sessions conveniently scheduled on Saturdays to meet the needs of busy professionals.</h2>\n<p><center>\n<a href=\"https://buy.stripe.com/aEU6r76te5586UU6or\"><button class=\"btn btn-lg btn-warning\">Get Started Today By Clicking Here</button></a>\n</center></p>","data":{"title":"Big Poppa Code’s Code Come Up Coaching Program","subTitle":"A 1 on 1 Individual Mentorship Experience Tailor Made To The Mentee","excerpt":"coaching program","featureImage":"/img/image1.jpeg","date":"10/21/21"},"isEmpty":false,"excerpt":"","path":"/home/bigpoppacode/code/bigpoppacode.io/api_static/mentorship.md","_id":"mentorship"}